In [1]:
# TO import or export files we need 'pandas' library
import pandas as pd

In [2]:
import os
os.getcwd()

'C:\\Users\\MSI\\Desktop\\Data Science Session-wise content\\S007-Pandas'

In [3]:
os.listdir()

['.ipynb_checkpoints',
 '1 Introduction to Pandas.ipynb',
 '2 File Import Export using Pandas.ipynb',
 '3-SF Salaries Exercise.ipynb',
 '4-Ecommerce Purchases Exercise .ipynb',
 '5-SF Salaries Exercise - Solutions.ipynb',
 '6-Ecommerce Purchases Exercise - Solutions.ipynb',
 'Ecommerce_Purchase.csv',
 'Pandas Task.ipynb',
 'Salaries.csv',
 'Share Market']

In [5]:
# Lets change working directory to path where we have data files
os.chdir("C:\\Users\\MSI\\Desktop\\DS using R\\Data Files\\")

In [6]:
os.getcwd()

'C:\\Users\\MSI\\Desktop\\DS using R\\Data Files'

In [7]:
os.listdir()

['.Rhistory',
 'Attrition_cleaned.csv',
 'Bank.rds',
 'Bank3.xlsx',
 'bank_data.csv',
 'bank_data.txt',
 'bank_data.xlsx',
 'cars.csv',
 'Cars_new.csv',
 'Cars_new.txt',
 'Cars_new.xlsx',
 'Chi-Square test.sav',
 'Churn.csv',
 'CLT.csv',
 'Data.sav',
 'Know_your_data.r',
 'melb_data.csv',
 'mydata.csv',
 'mydata.sav',
 'mydata.sps',
 'mydata.txt',
 'mydata1.csv',
 'mydata1.txt',
 'mydata2.csv',
 'RDS_data.rds',
 'regression.csv',
 'Sample_bank.csv',
 'Sample_bank.txt',
 'Sample_bank.xlsx',
 'seattleWeather_1948-2017.csv',
 'TS_data.csv']

In [ ]:
#os.chdir("D:\\Shiny\\")

In [ ]:
#os.getcwd()

In [ ]:
x = os.listdir()
print(type(x))
print(len(x))
y=[]
for i in x:
    if ('txt' in i):
        y.append(i)
print(y)

# Lets import csv file

In [8]:
df=pd.read_csv('cars.csv')

In [10]:
df.head(2) # 
#df.tail() #for last few observations, df for all data

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8,307.0,130,3504,12.0,70,US
1,Buick Skylark 320,15.0,8,350.0,165,3693,11.5,70,US

In [11]:
# We can specify entire path while reading data without setting wd
df2=pd.read_csv("C:\\Users\\MSI\\Desktop\\Master Class\\Data Science Session-wise content\\S007-Pandas\\Salaries.csv")
df2.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [ ]:
# Lets import txt file
# pd.read_csv works for both csv and txt file.
# specify separator while reading txt file

In [12]:
df3=pd.read_csv('Cars_new.txt', sep = '?')

In [13]:
df3.head()

,SR,age,job,marital,education,default,balance,housing,loan,contact
0,1,30,unemployed,married,primary,no,1787,no,no,cellular
1,2,33,services,married,secondary,no,4789,yes,yes,cellular
2,3,35,management,single,tertiary,no,1350,yes,no,cellular
3,4,30,management,married,tertiary,no,1476,yes,yes,unknown
4,5,59,blue-collar,married,secondary,no,0,yes,no,unknown

In [ ]:
# Lets import excel file

In [14]:
df4=pd.read_excel("bank_data.xlsx")
df4.head()

,SR,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,1,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,2,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,3,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,4,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,5,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [15]:
df4.shape

(4521, 18)

In [16]:
df4=pd.read_excel("bank_data.xlsx", sheet_name='part')
df4.head()

,SR,age,job,marital,education,default,balance,housing,loan,contact
0,1,30,unemployed,married,primary,no,1787,no,no,cellular
1,2,33,services,married,secondary,no,4789,yes,yes,cellular
2,3,35,management,single,tertiary,no,1350,yes,no,cellular
3,4,30,management,married,tertiary,no,1476,yes,yes,unknown
4,5,59,blue-collar,married,secondary,no,0,yes,no,unknown

In [17]:
df4.shape

(23, 10)

In [18]:
df4.iloc[15:20,:]

,SR,age,job,marital,education,default,balance,housing,loan,contact
15,16,40,management,married,tertiary,no,194,no,yes,cellular
16,17,56,technician,married,secondary,no,4073,no,no,cellular
17,18,37,admin.,single,tertiary,no,2317,yes,no,cellular
18,19,25,blue-collar,single,primary,no,-221,yes,no,unknown
19,20,31,services,married,secondary,no,132,no,no,cellular

In [ ]:
#df.index = list(range(1,407))

In [ ]:
#df.head()

In [ ]:
# Exporting files to csv, txt, xlsx

In [19]:
df4.to_csv("Cars_new.csv",index=False, header=True)

In [23]:
df4.to_csv("Cars_new.txt",index=False, header=True, sep = ' ')

In [25]:
df4.to_excel('Cars_new.xlsx',index=False,header=True)

In [ ]:
# Need Excelwriter package to write data on multiple sheets